#

# 판다스를  활용한 데이터 이해

### 01 파이썬 기본 다지기

In [2]:
myfood = ['banana','apple','candy']
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [3]:
for item in myfood:
    print(item)

banana
apple
candy

### 02 딕셔너리(Dictionary)

In [5]:
# 리스트, 튜플 < 딕셔너리, 시리즈 < 데이터프레임
dict1 = {'one':'하나','two':'둘','three':'셋'}     
dict2 = {1:'하나',2:'둘',3:'셋'}                   # key값을 숫자로 명명할 수 있다.
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [6]:
print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

### 03 판다스 모듈 불러오기

In [15]:
import pandas as pd
from pandas import Series, DataFrame  # Series 사용시 굳이 pd.을 붙이지 않으려면 라이브러리에서 특정 모듈만 불러오면 된다.

In [17]:
import matplotlib as mpl
import matplotlib.pyplot as plt

In [18]:
print("pandas 버전 확인 : ", pd.__version__)
print("matplotlib 버전 확인 : ", mpl.__version__)

pandas 버전 확인 :  1.2.4
matplotlib 버전 확인 :  3.3.4

In [25]:
score = Series([1000,14000,3000,30000,10000])
print('자료형:',type(score))
print(score)

자료형: <class 'pandas.core.series.Series'>
0     1000
1    14000
2     3000
3    30000
4    10000
dtype: int64

In [31]:
print(score.index)
print(list(score.index))
print(score.values)       # 자료형이 list 처럼 보이지만, 자료형은 numpy 이다.

print()

print(type(score.index))
print(type(score.values))

RangeIndex(start=0, stop=5, step=1)
[0, 1, 2, 3, 4]
[ 1000 14000  3000 30000 10000]

<class 'pandas.core.indexes.range.RangeIndex'>
<class 'numpy.ndarray'>

In [32]:
score = Series([1000,14000,3000],
               index = ['2019-05-01','2019-05-02','2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

#### 실습 1-1) Series 만들기

In [43]:
bank = Series([53380,218142,56091,74200,543533])
                
print(bank)

0     53380
1    218142
2     56091
3     74200
4    543533
dtype: int64

#### 실습 1-2) index 넣기

In [44]:
bank_idx = Series([53380,218142,56091,74200,543533],
              index = ['09_1st','09_2nd','09_3rd','09_4th','09_5th'])
print(bank_idx)

09_1st     53380
09_2nd    218142
09_3rd     56091
09_4th     74200
09_5th    543533
dtype: int64

In [45]:
for idx in score.index:
    print(idx)

2019-05-01
2019-05-02
2019-05-03

In [46]:
for value in score.values:
    print(value)

1000
14000
3000

#### 실습 1-2+) index 범위지정

In [51]:
import pandas as pd

In [54]:
# 100개의 index를 지정해줄 때
idx = pd.date_range(start='2020-01-01', end='2020-01-03').tolist()
auto_idx = Series( ['a', 'b', 'c'], 
                   index=idx)
auto_idx

2020-01-01    a
2020-01-02    b
2020-01-03    c
dtype: object

#### 실습 1-3) 두 팀의 점수 합산해보기

In [49]:
from pandas import Series

In [67]:
gildong = Series([1500,3000,2500],
                index = ['2019-05-01','2019-05-02','2019-05-03'])
dooly = Series([3000,3000,2000],
             index = ['2019-05-01','2019-05-03','2019-05-02'])

In [68]:
gildong + dooly
# 서로 같은 index의 value끼리 계산한다.

2019-05-01    4500
2019-05-02    5000
2019-05-03    5500
dtype: int64

#### 실습 1-4) 데이터는 1~90, 인덱스는 3개월치 날짜로 지정

In [70]:
value = list(range(1,91))
idx = pd.date_range(start='2020-01-01', end='2020-03-30').tolist()

three_month_90 = Series( value, 
                        index=idx)

print(three_month_90)

2020-01-01     1
2020-01-02     2
2020-01-03     3
2020-01-04     4
2020-01-05     5
              ..
2020-03-26    86
2020-03-27    87
2020-03-28    88
2020-03-29    89
2020-03-30    90
Length: 90, dtype: int64

#

#

# 데이터 프레임(DataFrame)의 이해

* Pandas의 기본 자료형
* Seaborn 데이터 (load_dataset() )
  * seaborn에 들어가는 기본적인 데이터 자료형 pandas
* plotly에서도 pandas호환

### 01 DataFrame 생성하기
* Dictionary -> DataFrame
* Series     -> DataFrame
* index 옵션 추가하기

In [72]:
from pandas import DataFrame

In [80]:
# <데이트 프레임 형태의 자료 가져오는 방법>
# 방법1. 데이터 프레임 형태의 파일 가져오기
# 방법2. 딕셔너리로 만들고 이후 데이터 프레임으로 변환하기
dat = {'col1': [1,2,3,4],
       'col2': [10,20,30,40],
       'col3': ['A','B','C','D']}

dat_df = DataFrame(dat)
dat_df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

#### 실습 1-5) 나만의 데이터 프레임 만들기

In [94]:
fav_dict = {'movie' : ['Mamma Mia','해어화','A Star is Born', None],
       'song'  : ['너의 의미', '섬(Queen of Diamonds)', 'Back to Black','사람이 사랑하면 안돼요'],
       'place' : ['한강','CHICAGO','NewYork','강릉']}

fav_df = DataFrame(fav_dict,index=['1st','2nd','3rd','4th'])
fav_df

              movie                  song    place
1st       Mamma Mia                 너의 의미       한강
2nd             해어화  섬(Queen of Diamonds)  CHICAGO
3rd  A Star is Born         Back to Black  NewYork
4th            None          사람이 사랑하면 안돼요       강릉

In [95]:
# 공백을 일괄적으로 채우기 위해선 딕셔너리가 아니라 Series 를 사용한다.

fav_movie = pd.Series(['Mamma Mia','해어화','A Star is Born'])
fav_song = pd.Series(['너의 의미', '섬(Queen of Diamonds)', 'Back to Black','사람이 사랑하면 안돼요'])
fav_place =pd.Series(['한강','CHICAGO','NewYork','강릉'])

fav_series ={'moveie': fav_movie, 'song':fav_song, 'place':fav_place}
fav_se_df = pd.DataFrame(fav_series)
fav_se_df

           moveie                  song    place
0       Mamma Mia                 너의 의미       한강
1             해어화  섬(Queen of Diamonds)  CHICAGO
2  A Star is Born         Back to Black  NewYork
3             NaN          사람이 사랑하면 안돼요       강릉

#### 실습 1-6)

In [100]:
from pandas import DataFrame

team_score = { "toto":[1500,3000,5000,7000,5500],
               "apple":[4000,5000,6000,5500,4500],
               "gildong":[2000,2500,3000,4000,3000],
               "catanddog":[7000,5000,3000,5000,4000]}

team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

### 02 DataFrame에서 정보 크롭하기
* DATAFRAME[ ]        : 전체 행과 특정 열 추출
* DATAFRAME.loc[ ]    : index명으로 특정 행,열 추출
* DATAFRAME.iloc[ ]   : index위치로 특정 해,열 추출 (주의 : [1:4]는 1,2,3만 해당)

#### 실습 2-1) DATAFRAME[ ] : 전체 행과 특정 열 추출 
* 행 : 생략
* 행 : 전체선택명령어 사용 불가능 -> : (X)
* 열 : indexing 허용 -> ['col1','col2','col3'] (O)
* 열 : slicing 불가능 -> col1 : col3 (X)

In [195]:
# 전체 행을 출력하는 것이기 때문에, 행 정보는 쓰지 않는다.
# 열 선택시, 지정선택(indexing [,]) 만 허용
team_df[ ['toto','gildong'] ]

   toto  gildong
0  1500     2000
1  3000     2500
2  5000     3000
3  7000     4000
4  5500     3000

In [172]:
# 열 선택시, 범위선택(slicing :) 불가능
team_df['toto':'gildong']

TypeError: cannot do slice indexing on RangeIndex with these indexers [toto] of type str

#### 실습 2-2) DATAFRAME.loc[ ]    : index명 사용

* 행 : (주의)index 명이 1 부터 시작하면 첫번째 인덱스는 0 이 아닌 1

* entire
  * :
* 선택지정 / indexing
  * [ 'A' , 'C' ] ------- 대괄호 있음
  * 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.
* 범위지정 / slicing
  * 'A' : 'C' ---------- 대괄호 없음

In [179]:
# 전체 행 선택( : )
team_df.loc[:,'toto':'gildong']

   toto  apple  gildong
0  1500   4000     2000
1  3000   5000     2500
2  5000   6000     3000
3  7000   5500     4000
4  5500   4500     3000

In [181]:
# 전체 열 선택 ( : )
team_df.loc[1:3,:]

   toto  apple  gildong  catanddog
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000

In [182]:
# 지정선택 / indexing
team_df.loc[[0,2,4],['toto','gildong']]

   toto  gildong
0  1500     2000
2  5000     3000
4  5500     3000

In [207]:
# 하나 지정선택(indexing)시 대괄호를 사용하는 경우
# DataFrame형태로 가져오기
team_df.loc[:,['gildong']]

   gildong
0     2000
1     2500
2     3000
3     4000
4     3000

In [208]:
# 하나 지정선택(indexing)시 대괄호를 사용하지 않는 경우
# series형태로 가져오기
team_df.loc[:,'gildong']

0    2000
1    2500
2    3000
3    4000
4    3000
Name: gildong, dtype: int64

In [209]:
# 범위선택 / slicing
team_df.loc[1:3,'toto':'gildong']
# row 값 1:3 -> 1,2,3 출력

   toto  apple  gildong
1  3000   5000     2500
2  5000   6000     3000
3  7000   5500     4000

In [210]:
# 지정선택(indexing) + 범위선택(slicing)
team_df.loc[[0,1,4],'apple':'catanddog']     # dataframe형태로 가져오기

   apple  gildong  catanddog
0   4000     2000       7000
1   5000     2500       5000
4   4500     3000       4000

In [211]:
# 범위선택(slicing) + 지정선택(indexing)
team_df.loc[2:4, ['apple','catanddog']]

   apple  catanddog
2   6000       3000
3   5500       5000
4   4500       4000

#### 실습 2-3) DATAFRAME.iloc[ ] : index 위치 사용 (주의 : [1:4]는 1,2,3만 해당)
* 모든 인덱스는 0 부터 시작
* entire
  * :
* 선택지정 / indexing
  * [ 1 , 3 ] ------- 대괄호 있음
  * 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.

* 범위지정 / slicing
  * 1 : 3 ---------- 대괄호 없음
  * (주의!) 1:3의 경우 파이썬 문법에 따라 3은 제외
  * (응용1) 0:5:2 -> 0, 2, 4
  * (응용2) 5:0:-2 -> 5, 3, 1
  * (응용3) -1: -> 뒤에서부터

In [212]:
# 전체 선택
team_df.iloc[:,:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [204]:
# 지정선택 / indexing
team_df.iloc[[0],:]

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000

In [213]:
# 지정선택 / indexing
# 하나 지정선택(indexing)시 대괄호를 사용하지 않으면, 자료형 Series 형태로 가져온다.
team_df.iloc[0,:]

toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 0, dtype: int64

In [217]:
# 지정선택 / indexing
team_df.iloc[ [2,4],: ]

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
4  5500   4500     3000       4000

In [218]:
# 범위선택 / slicing
team_df.iloc[ 2:4 , : ]   # 4-1= 3 까지

   toto  apple  gildong  catanddog
2  5000   6000     3000       3000
3  7000   5500     4000       5000

In [221]:
# 선택지정(indexing)+ 범위선택(slicing)
team_df.iloc[[1,4],1:4]

   apple  gildong  catanddog
1   5000     2500       5000
4   4500     3000       4000

#### 실습 2-4) loc,iloc이용하여 열에 접근

In [222]:
idx_date = pd.date_range(start="2019-05-01",end="2019-05-05").tolist()
team_df.index = idx_date
team_df

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [228]:
print(team_df.loc[ '2019-05-02' ] ) # 19-05-02 일
print("-----------")
print(team_df.loc[ ['2019-05-02', '2019-05-03'] ]) # 5월 2일, 3일 
print("-----------")
print(team_df.loc[ '2019-05-02': ])  # 5월 2일 이후 전체 데이터 가져오기

toto         3000
apple        5000
gildong      2500
catanddog    5000
Name: 2019-05-02 00:00:00, dtype: int64
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
-----------
            toto  apple  gildong  catanddog
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [229]:
print('컬러명 : ',team_df.columns)
print(team_df.loc[:, ['toto']])   # 전체행, toto팀 
print("-----")
print(team_df.loc[:, ['toto', 'gildong'] ])   # 전체행, toto, gildong팀
print("-----")
print(team_df.loc[:, 'toto': ])   # 전체행, toto 부터 끝까지

컬러명 :  Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')
            toto
2019-05-01  1500
2019-05-02  3000
2019-05-03  5000
2019-05-04  7000
2019-05-05  5500
-----
            toto  gildong
2019-05-01  1500     2000
2019-05-02  3000     2500
2019-05-03  5000     3000
2019-05-04  7000     4000
2019-05-05  5500     3000
-----
            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [234]:
print('1번째 행\n',team_df.iloc[0])      # 첫번째 행 접근
print("------")
print('1번째,2번째 행\n',team_df.iloc[ [0,1] ])  # 첫번째 두번째 행 접근
print("------")
print('1번째~3번째 행\n',team_df.iloc[ 0:3:1] )  # 첫번째부터 세번째 행 접근
print("------")
range_num = list(range(0,3,1))
print('1번째~3번째 행\n',team_df.iloc[ range_num ] )  # 첫번째부터 세번째 행 접근

1번째 행
 toto         1500
apple        4000
gildong      2000
catanddog    7000
Name: 2019-05-01 00:00:00, dtype: int64
------
1번째,2번째 행
             toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
------
1번째~3번째 행
             toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
------
1번째~3번째 행
             toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000

### 03 일반 통계 - 합, 평균, 표준편차

In [235]:
team_df

            toto  apple  gildong  catanddog
2019-05-01  1500   4000     2000       7000
2019-05-02  3000   5000     2500       5000
2019-05-03  5000   6000     3000       3000
2019-05-04  7000   5500     4000       5000
2019-05-05  5500   4500     3000       4000

In [240]:
team_df.sum(axis=0)  #axis=0: index별 합

toto         22000
apple        25000
gildong      14500
catanddog    24000
dtype: int64

In [242]:
team_df.sum(axis=1)  #axis=1: colum별 합

2019-05-01    14500
2019-05-02    15500
2019-05-03    17000
2019-05-04    21500
2019-05-05    17000
dtype: int64

#### 실습 3-1) 통계량 구하기

In [250]:
print( '<Max>\n',team_df.max(), end='\n\n' )
print( '<Min>\n',team_df.min(), end='\n\n' )
print( '<Mean>\n',team_df.mean(), end='\n\n' )
print( '<Std Dev>\n',team_df.std(), end='\n\n' )
print( '<Var>\n',team_df.var(), end='\n\n' )
print( '<중앙값>\n',team_df.median())

<Max>
 toto         7000
apple        6000
gildong      4000
catanddog    7000
dtype: int64

<Min>
 toto         1500
apple        4000
gildong      2000
catanddog    3000
dtype: int64

<Mean>
 toto         4400.0
apple        5000.0
gildong      2900.0
catanddog    4800.0
dtype: float64

<Std Dev>
 toto         2162.174831
apple         790.569415
gildong       741.619849
catanddog    1483.239697
dtype: float64

<Var>
 toto         4675000.0
apple         625000.0
gildong       550000.0
catanddog    2200000.0
dtype: float64

<중앙값>
 toto         5000.0
apple        5000.0
gildong      3000.0
catanddog    5000.0
dtype: float64

In [251]:
team_df['toto'].sum()

22000

In [258]:
team_df[['toto','gildong']].sum()

toto       22000
gildong    14500
dtype: int64

In [253]:
team_df.count()

toto         5
apple        5
gildong      5
catanddog    5
dtype: int64

In [255]:
team_df.count().index

Index(['toto', 'apple', 'gildong', 'catanddog'], dtype='object')

In [256]:
team_df.count().values

array([5, 5, 5, 5])

In [257]:
import seaborn as sns

In [259]:
sns.heatmap(team)

NameError: name 'team' is not defined

#### 실습 3-2) apple과 catanddog의 sum(),mean(),std()

In [267]:
print('<합>\n',team_df[['apple','catanddog']].sum())
print('\n<평균>\n',team_df[['apple','catanddog']].mean())
print('\n<표준편차>\n',team_df[['apple','catanddog']].std())

<합>
 apple        25000
catanddog    24000
dtype: int64

<평균>
 apple        5000.0
catanddog    4800.0
dtype: float64

<표준편차>
 apple         790.569415
catanddog    1483.239697
dtype: float64

#### 실습 3-3) team_df의 sum()을 구하고 기존의 team_df에 추가해 보자.

In [345]:
sum = team_df[['toto','apple','gildong','catanddog']].sum(axis=1)
team_df['sum'] = sum
print(sum)
print(team_df)

2019-05-01    14500
2019-05-02    15500
2019-05-03    17000
2019-05-04    21500
2019-05-05    17000
dtype: int64
            toto  apple  gildong  catanddog    sum
2019-05-01  1500   4000     2000       7000  14500
2019-05-02  3000   5000     2500       5000  15500
2019-05-03  5000   6000     3000       3000  17000
2019-05-04  7000   5500     4000       5000  21500
2019-05-05  5500   4500     3000       4000  17000

In [347]:
team_df['rowsum'] = team_df.loc[:,'toto':'catanddog'].sum(axis=1)
#del team_df['rowsum']
team_df

            toto  apple  gildong  catanddog    sum  rowsum
2019-05-01  1500   4000     2000       7000  14500   14500
2019-05-02  3000   5000     2500       5000  15500   15500
2019-05-03  5000   6000     3000       3000  17000   17000
2019-05-04  7000   5500     4000       5000  21500   21500
2019-05-05  5500   4500     3000       4000  17000   17000

In [349]:
team_df

            toto  apple  gildong  catanddog    sum  rowsum
2019-05-01  1500   4000     2000       7000  14500   14500
2019-05-02  3000   5000     2500       5000  15500   15500
2019-05-03  5000   6000     3000       3000  17000   17000
2019-05-04  7000   5500     4000       5000  21500   21500
2019-05-05  5500   4500     3000       4000  17000   17000

In [350]:
team_df.cumsum() # index가 증가할 수록(index = 날짜, 날이 지날수록) 값이 누적돼서 출력

             toto  apple  gildong  catanddog    sum  rowsum
2019-05-01   1500   4000     2000       7000  14500   14500
2019-05-02   4500   9000     4500      12000  30000   30000
2019-05-03   9500  15000     7500      15000  47000   47000
2019-05-04  16500  20500    11500      20000  68500   68500
2019-05-05  22000  25000    14500      24000  85500   85500

#### 실습 3-4) Titanic 예제
* 행 선택, 열 선택, 통계 값 구하기(sum(), mean(), count() ) 그리고 이에 대한 통계량을 추가해보기

In [324]:
import seaborn as sns
t = sns.load_dataset("titanic")
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [356]:
t_ten = t.loc[10:20,['survived','sex','age','fare','class']]
t_ten

    survived     sex   age     fare   class
10         1  female   4.0  16.7000   Third
11         1  female  58.0  26.5500   First
12         0    male  20.0   8.0500   Third
13         0    male  39.0  31.2750   Third
14         0  female  14.0   7.8542   Third
15         1  female  55.0  16.0000  Second
16         0    male   2.0  29.1250   Third
17         1    male   NaN  13.0000  Second
18         0  female  31.0  18.0000   Third
19         1  female   NaN   7.2250   Third
20         0    male  35.0  26.0000  Second

In [361]:
print("<평균값>\n",t_ten.mean())
print("\n<최댓값>\n",t_ten.max())
print("\n<최솟값>\n",t_ten.min())
print("\n<합계>\n",t_ten.sum(axis=0)) # 생존자 인원수 확인용

<평균값>
 survived     0.454545
age         28.666667
fare        18.161745
dtype: float64

<최댓값>
 survived         1
sex           male
age           58.0
fare        31.275
dtype: object

<최솟값>
 survived         0
sex         female
age            2.0
fare         7.225
dtype: object

<합계>
 survived                                                    5
sex         femalefemalemalemalefemalefemalemalemalefemale...
age                                                     258.0
fare                                                 199.7792
dtype: object